


import React from "react";


// ---------------------------------------------------------------------
const Fragment = () => {
  return(
    <React.Fragment>
      <p>Согласно правилам рект для нужно обернуть нас в один элемент</p>
      <p>Это может быть любой тег, или же...</p>
      <p>Это может быть react fragment</p>
    </React.Fragment>
  );
}
// ---------------------------------------------------------------------
const ElementHtml = () => {
  return(
    <footer>
      <p>Согласно правилам рект для нужно обернуть нас в один элемент</p>
      <p>Это может быть любой тег, или же...</p>
      <p>Это может быть react fragment</p>
    </footer>
  );
}
// ----------------------------------------------------------------------
const ShortFragment = () => {
  return(
    <>
      <p>Согласно правилам рект для нужно обернуть нас в один элемент</p>
      <p>Это может быть любой тег, или же...</p>
      <p>Это может быть react fragment</p>
    </>
  );
}
// -----------------------------------------------------------------------





















































